console.log("hello world");

// 자바 스크립트 에서 변수를 선언할 때는, 변하지 않는 값은 const,
// 변할 수 있는 값은 let으로 선언
// tip : 모든 변수를 const로 선언하고 변경될 수 있는 변수는 let으로 바꾸기
let name = "Mike";

// 1000 lines.....
//let name = "google";

/*
변수 규칙
1. 변수는 문자와 숫자, $와 _만을 사용
2. 첫글짜는 숫자가 될 수 없다
3. 예약어(Reserved words)는 사용할 수 없다
4. 가급적 상수는 대문자로 사용
5. 변수명은 읽기 쉽고 이해할 수 있게 선언


let
1. 똑같은 변수 두 번 let으로 선언 불가 (수정은 가능)
2. let 변수 값을 바꾸고 싶을 때는 let 빼고 name = "google";
3. let 장점 : 이미 사용하고 있는 변수를 알 수 있다. 
(똑같은 변수 사용시 경고창 발생)
*/

/*
const : 절대로 바뀌지 않는 상수(를 선언)
1. 수정 X
2. 바뀌지 않는 값 : 파이, 생일 값
3. 대문자로 선언하는 것이 좋음(다른 개발자들이 상수라는 것을 알 수 있다)
const PI = 3.14;
const SPEED_LIMIT =50;
const BIRTH_DAY = '2020-01-01';
*/
